Autodesk.Revit.DB.Analysis.SpatialFieldManager.AddSpatialFieldPrimitive(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates analysis results primitive from 3 points that designate a plane
p0:
First point of the triangle.
p1:
Second point of the triangle.
p2:
Third point of the triangle.
Returns:
Unique index of primitive for future references
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.AddSpatialFieldPrimitive(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Int32})
Creates analysis results primitive from a list of points and a list of indices that indicate a set of triangles, every 3 indices designate a triangle in the points list.
points:
List of points that define the triangles.
indices:
List of indices in to the points list. Each 3 indices define a triangle.
Returns:
Unique indices of primitive for future references
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011